ShangqunYu/DashMotorControl/G474_hello_world/Core/Src/stm32_bitbang_spi.c
/*
 * stm32_bitbang_spi.c
 *
 *  Created on: Nov 5, 2025
 *      Author: yusha
 */

#include "stm32_bitbang_spi.h"

// --- Private function for microsecond delay using DWT ---
static void delay_us(uint32_t us) {
    uint32_t start = DWT->CYCCNT;
    //ticks = microseconds × (cycles per microsecond)
    uint32_t ticks = us * (SystemCoreClock / 1000000);
    while ((DWT->CYCCNT - start) < ticks);
}

void BitbangSPI_Init(BitbangSPI* spi, const BitbangSPI_Options* options) {
    spi->options = *options;

    if (spi->options.mode != 1) {
        Error_Handler();  // only CPOL=0, CPHA=1 supported
    }

    // Compute half-period delay (approximate)
    spi->us_delay = (500000 / spi->options.frequency);
    if (spi->us_delay < 1) spi->us_delay = 1;

    // Initialize GPIO states
    HAL_GPIO_WritePin(spi->options.sck_port, spi->options.sck_pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(spi->options.mosi_port, spi->options.mosi_pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(spi->options.cs_port, spi->options.cs_pin, GPIO_PIN_SET);

    // Enable DWT counter for microsecond delays if not already enabled
    if (!(DWT->CTRL & DWT_CTRL_CYCCNTENA_Msk)) {
    	// Enable TRC
        CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
        DWT->CYCCNT = 0;
        // Enable clock cycle counter
        DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
    }
}

uint16_t BitbangSPI_Write(BitbangSPI* spi, uint16_t value) {
    HAL_GPIO_WritePin(spi->options.cs_port, spi->options.cs_pin, GPIO_PIN_RESET);
    delay_us(spi->us_delay);

    uint16_t result = 0;

    for (int i = spi->options.width; i > 0; i--) {
        // Write MOSI bit
        if (value & (1 << (i - 1))) {
            HAL_GPIO_WritePin(spi->options.mosi_port, spi->options.mosi_pin, GPIO_PIN_SET);
        } else {
            HAL_GPIO_WritePin(spi->options.mosi_port, spi->options.mosi_pin, GPIO_PIN_RESET);
        }

        // Clock high
        HAL_GPIO_WritePin(spi->options.sck_port, spi->options.sck_pin, GPIO_PIN_SET);
        delay_us(spi->us_delay);

        // Read MISO
        result <<= 1;
        if (HAL_GPIO_ReadPin(spi->options.miso_port, spi->options.miso_pin) == GPIO_PIN_SET) {
            result |= 1;
        }

        // Clock low
        HAL_GPIO_WritePin(spi->options.sck_port, spi->options.sck_pin, GPIO_PIN_RESET);
        delay_us(spi->us_delay);
    }

    // Idle state
    HAL_GPIO_WritePin(spi->options.mosi_port, spi->options.mosi_pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(spi->options.cs_port, spi->options.cs_pin, GPIO_PIN_SET);
    delay_us(spi->us_delay);

    return result;
}

uint16_t BitbangSPI_Read(BitbangSPI* spi, uint16_t addr) {

    return BitbangSPI_Write(spi, addr | (1<<15));  
}